---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevel
source: html/8f78532d-3f3b-611e-3287-67dd39d97b0d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevel Property

The start level and end level for this staircase must be at different elevations.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidStartLevel { get; }
```